app/Controllers/Home.php

    public function table(){
        $data['client']=$this->client->findAll();
---
SELECT *
FROM `client`

public function generateInvoice($id)
{
    $client = $this->client->find($id);
    $vehicule = $this->vehicule->where('Num_vehicule', $client['id_voiture'])->first();
---
SELECT *
FROM `client`
WHERE `client`.`id` = '30'
SELECT *
FROM `vehicule`
WHERE `Num_vehicule` = 'E98760V34'
 LIMIT 1